
















import React, { useState, useEffect } from "react";

const questions =[
  {
    id: 1,
    question: "யானையின் ஒலி மரபைக் கண்டறிக.",
    options: ["அலப்பும்", "பிளிறும்", "எக்காளமிடும்", "கதறும்"],
    answer: "பிளிறும்"
  },
  {
    id: 2,
    question: "'யாதும் ஊரே யாவரும் கேளிர்' - 'கேளிர்' எதிர்ச்சொல்?",
    options: ["சகோதரி", "நண்பர்", "உறவினர்", "பகைவர்"],
    answer: "பகைவர்"
  },
  {
    id: 3,
    question: "பொருந்தாச் சொல்லைக் கண்டறிக:",
    options: ["செற்றார்", "உற்றார்", "நண்ணார்", "ஒன்னார்"],
    answer: "உற்றார்"
  },
  {
    id: 4,
    question: "வெற்றி, வீரம், வலி தரும் சொல்?",
    options: ["விறல்", "வென்றி", "விரல்", "வறம்"],
    answer: "விறல்"
  },
  {
    id: 5,
    question: "BLOGGER தமிழில்?",
    options: ["வலையொளி", "வலைப்பதிவர்", "காணொளி படைப்பாளர்", "தள வடிவமைப்பாளர்"],
    answer: "வலைப்பதிவர்"
  },
  {
    id: 6,
    question: "உ.வே. சாமிநாதரின் வாழ்க்கை வரலாறு நூல்?",
    options: ["மனவாசம்", "சுய சரிதம்", "என் சரிதம்", "என் கதை"],
    answer: "என் சரிதம்"
  },
  {
    id: 7,
    question: "பிறமொழிச் சொல்லைக் கண்டறிக:",
    options: ["நிறைவு", "வெளியீடு", "வாடகை", "ஒழுங்கு"],
    answer: "வாடகை"
  },
  {
    id: 8,
    question: "'இடிய ஓசை கேட்ட நாகம்போல' - பொருள்?",
    options: ["வன்மம்", "ஏக்கம்", "மிரட்சி", "திரட்சி"],
    answer: "மிரட்சி"
  },
  {
    id: 9,
    question: "'Assailant' தமிழில்?",
    options: ["தாக்குபவர்", "முன் மரபினர்", "உறவினர்", "புனைவு நபர்"],
    answer: "தாக்குபவர்"
  },
  {
    id: 10,
    question: "குமணன் நடந்தான் - வினை வகை?",
    options: ["தன்வினை", "பிறவினை", "பொதுவினை", "எதிர்மறை வினை"],
    answer: "தன்வினை"
  },

  {
    id: 11,
    question: "'உள் + மனம்' சேர்த்து எழுதுக:",
    options: ["உன்மனம்", "உண்மனம்", "உள்மனம்", "உம்மனம்"],
    answer: "உள்மனம்"
  },
  {
    id: 12,
    question: "'அப்பாவி' சரியான திருத்தம்?",
    options: ["அடப்பாவி", "அற்பாவி", "அற்ப பாவி", "அற்ப ஆவி"],
    answer: "அற்ப ஆவி"
  },
  {
    id: 13,
    question: "காகத்திற்கு மற்றொரு பெயர்?",
    options: ["புட்டில்", "புட்டி", "புட்டம்", "புட்டகம்"],
    answer: "புட்டம்"
  },
  {
    id: 14,
    question: "அன்புக்குரியவரின் துன்பக் கண்ணீர்?",
    options: ["புண்கணீர்", "புங்கணீர்", "புயங்கணீர்", "புன்கணீர்"],
    answer: "புன்கணீர்"
  },
  {
    id: 15,
    question: "'ஏது?, யாது?' எந்த வகை?",
    options: ["பெயர்ச் சொற்கள்", "வினைச் சொற்கள்", "சுட்டுச் சொற்கள்", "இடைச் சொற்கள்"],
    answer: "சுட்டுச் சொற்கள்"
  },

  {
    id: 16,
    question: "'இலஞ்சி' எந்த மொழிச் சொல்?",
    options: ["டச்சு", "பிரெஞ்சு", "போர்ச்சுகீசியம்", "தமிழ்"],
    answer: "போர்ச்சுகீசியம்"
  },
  {
    id: 17,
    question: "'உத்தமம்' சுருக்கம்?",
    options: ["உலகத் தமிழ்த் தகவல் தொழில்நுட்ப மன்றம்", "உலகத் தமிழ் மன்றம்", "உலகத் தமிழாராய்ச்சி மன்றம்", "உலகத் தமிழ்ச் சங்கம்"],
    answer: "உலகத் தமிழ்த் தகவல் தொழில்நுட்ப மன்றம்"
  },
  {
    id: 18,
    question: "அனிச்சம் மலர் போல விருந்தினர் எப்போது வாடுவர்?",
    options: ["வரவேற்கவில்லையானால்", "இனியமொழி பேசவில்லையானால்", "கடுஞ்சொற்கள் பேசினால்", "முகம் திரிந்து நோக்கினால்"],
    answer: "முகம் திரிந்து நோக்கினால்"
  },
  {
    id: 19,
    question: "'ஓதலிற் சிறந்தன்று ஒழுக்கமுடைமை' இடம்பெற்ற நூல்?",
    options: ["நாலடியார்", "முதுமொழிக்காஞ்சி", "பழமொழி நானூறு", "இன்னா நாற்பது"],
    answer: "முதுமொழிக்காஞ்சி"
  },
  {
    id: 20,
    question: "சமண அறக்கருத்து?",
    options: ["தீண்டாமை", "ஒழுக்கமுடைமை", "கொல்லாமை", "அறிவுடைமை"],
    answer: "கொல்லாமை"
  },

  {
    id: 21,
    question: "'நீறு' என்பதன் பொருள்?",
    options: ["சாம்பல்", "மண்", "நீர்", "கலவை"],
    answer: "சாம்பல்"
  },
  {
    id: 22,
    question: "'மீதூண் விரும்பேல்' தொடர்பான பழமொழி?",
    options: ["நோயற்ற வாழ்வே குறைவற்ற செல்வம்", "நீரடித்து நீர் விலகாது", "உப்பிட்டவரை உள்ளளவும் நினை", "நொறுங்கத் தின்றால் நூறு வயது"],
    answer: "நொறுங்கத் தின்றால் நூறு வயது"
  },

  {
    id: 23,
    question: "பிழையற்ற அஃறிணைப் பன்மை?",
    options: ["அவள் அல்லள்", "மரம் அன்று", "அவை அல்ல", "அவன் அல்ல"],
    answer: "அவை அல்ல"
  },
  {
    id: 24,
    question: "சரியான தொடரைத் தேர்வு செய்க:",
    options: ["மாடுகள் மேய்ந்தது", "பறவைகள் பறந்தது", "மரம் வளர்ந்தன", "செடி கொடிகள் காற்றில் அசைந்தன"],
    answer: "செடி கொடிகள் காற்றில் அசைந்தன"
  },
  {
    id: 25,
    question: "'மானின்' தொகை மரபுச் சொல்?",
    options: ["மந்தை", "நிரை", "கணம்", "கூட்டம்"],
    answer: "கணம்"
  },
  {
    id: 26,
    question: "'வேணன்மை' என்னும் சொல்லைப் பிரித்து எழுதுக.",
    options: ["வேணன் + மை", "வேண் + அன்மை", "வேண் + நன்மை", "வேள் + நன்மை"],
    answer: "வேள் + நன்மை"
  },
  {
    id: 27,
    question: "'அது + அன்று' - சேர்த்து எழுதுக.",
    options: ["அதுவன்று", "அதுஅன்று", "அதினன்று", "அதான்று"],
    answer: "அதான்று"
  },
  {
    id: 28,
    question: "பிழையற்ற தொடரைக் கண்டறிக.",
    options: ["ஆடூஉ வந்தாள்", "மகடூ வந்தான்", "மகடூ வந்தாள்", "சாத்தி வந்தான்"],
    answer: "மகடூ வந்தாள்"
  },
  {
    id: 29,
    question: "'விறல்' என்னும் சொல்லின் பொருள்?",
    options: ["வெற்றி, வீரம், வலி", "பகை, அச்சம், கோபம்", "அன்பு, கருணை, ஈகை", "கல்வி, அறிவு, செல்வம்"],
    answer: "வெற்றி, வீரம், வலி"
  },
  {
    id: 30,
    question: "வேர்க்குரு என்னும் சொல்லின் பேச்சுவழக்கு?",
    options: ["வேர்குறு", "வேர்க்குறு", "வேர்வை", "வியர்வை"],
    answer: "வேர்க்குறு"
  },

  {
    id: 31,
    question: "மாலையிற் பிறந்த பிள்ளை ______ ஆகாது.",
    options: ["அம்மாவுக்கு", "தாத்தாவுக்கு", "தங்கைக்கு", "மாமனுக்கு"],
    answer: "மாமனுக்கு"
  },
  {
    id: 32,
    question: "செயப்பாட்டு வினைத் தொடரைக் கண்டறிக.",
    options: [
      "குமரன் பாடம் பயின்றான்",
      "இளங்கோவடிகள் சிலப்பதிகாரம் இயற்றினார்",
      "கபிலர் குறிஞ்சிப்பாட்டு இயற்றினார்",
      "தை கொண்டாடப் பெற்றது"
    ],
    answer: "தை கொண்டாடப் பெற்றது"
  },
  {
    id: 33,
    question: "புவியியல் மற்றும் சுரங்க ஆய்வகம் எந்தத் துறையைச் சார்ந்தது?",
    options: ["இயற்கை வளங்கள் துறை", "உயர்கல்வித் துறை", "சுற்றுச்சூழல் துறை", "வனத்துறை"],
    answer: "இயற்கை வளங்கள் துறை"
  },
  {
    id: 34,
    question: "அஃறிணை ஒருமை எது?",
    options: ["அவர், அவர்கள்", "அவை, நாய்கள்", "அது, நாய்", "தங்கை"],
    answer: "அது, நாய்"
  },
  {
    id: 35,
    question: "கூற்று-காரணம் சரியானது எது?",
    options: [
      "கூற்று சரி; காரணம் தவறு",
      "கூற்று சரி; காரணம் சரி",
      "கூற்று தவறு; காரணம் சரி",
      "கூற்று தவறு; காரணம் தவறு"
    ],
    answer: "கூற்று தவறு; காரணம் தவறு"
  },

  {
    id: 36,
    question: "'கனலி' என்ற சொல்லைக் குறிக்காதது எது?",
    options: ["சூரியன்", "நெருப்பு", "பன்றி", "கரும்பு"],
    answer: "கரும்பு"
  },
  {
    id: 37,
    question: "இப்பாடலை இயற்றியவர் யார்?",
    options: ["உறையூர் முதுகூற்றனார்", "உறையூர் முதுகொற்றனார்", "உருத்திரங்கண்ணனார்", "உறையூர் இளம்பொன் வாணிகனார்"],
    answer: "உருத்திரங்கண்ணனார்"
  },
  {
    id: 38,
    question: "பெருஞ்சித்திரனாரால் நடத்தப்படாத இதழ்?",
    options: ["தென்மொழி", "தமிழ்ச்சிட்டு", "தேசபக்தன்", "தமிழ் நிலம்"],
    answer: "தேசபக்தன்"
  },
  {
    id: 39,
    question: "'மனைக்கு விளக்கம் மடவார்' இடம்பெற்ற நூல்?",
    options: ["நாலடியார்", "திருக்குறள்", "இன்னா நாற்பது", "நான்மணிக்கடிகை"],
    answer: "நான்மணிக்கடிகை"
  },
  {
    id: 40,
    question: "சரியான திருக்குறள் எது?",
    options: [
      "சொல்லுக சொல்லில் சொல்லற்க பயனுடைய சொல்லில் பயன்இலாச் சொல்",
      "சொல்லில் சொல்லுக சொல்லற்க பயனுடைய சொல்லில் பயன்இலாச் சொல்",
      "சொல்லுக சொல்லில் பயனுடைய சொல்லில் சொல்லற்க பயன்இலாச் சொல்",
      "சொல்லுக சொல்லில் பயனுடைய சொல்லற்க சொல்லில் பயன்இலாச் சொல்"
    ],
    answer: "சொல்லுக சொல்லில் பயனுடைய சொல்லற்க சொல்லில் பயன்இலாச் சொல்"
  },

  {
    id: 41,
    question: "ஒற்றுப்பிழையைச் சரி செய்க:",
    options: [
      "வள்ளலார் அருளிய வழிகளை கடைப்பிடித்து ஒழுகினால் மனிதநேயம் மலரும்.",
      "வள்ளலாரருளிய வழிகளைக் கடைபிடித்து ஒழுகினால் மனிதநேயம் மலரும்.",
      "வள்ளலார் அருளிய வழிக்கனைக் கடைப்பிடித்து ஒழுகினால் மனிதநேயம் மலரும்.",
      "வள்ளலார் அருளிய வழிகளைக் கடைப் பிடித்து ஒழுகினால் மனிதநேயம் மலரும்."
    ],
    answer: "வள்ளலார் அருளிய வழிகளைக் கடைப் பிடித்து ஒழுகினால் மனிதநேயம் மலரும்."
  },
  {
    id: 42,
    question: "பிழையற்ற தொடரைத் தேர்க:",
    options: [
      "அமைச்சர் பதவியேற்றவுடன் பாராட்டுகள் குவிந்தன; தொண்டர்கள் பரிசுப் பொருட்களைக் குவித்தனர்.",
      "அமைச்சர் பதவியேற்றவுடன் பாராட்டுகள் குவித்தன; தொண்டர்கள் பரிசுப் பொருட்களைக் குவித்தனர்.",
      "அமைச்சர் பதவியேற்றவுடன் பாராட்டுகள் குவித்தன; தொண்டர்கள் பரிசுப் பொருட்களைக் குவிந்தனர்.",
      "அமைச்சர் பதவியேற்றவுடன் பாராட்டுகள் குவிந்தனர்; தொண்டர்கள் பரிசுப் பொருட்களைக் குவிந்தனர்."
    ],
    answer: "அமைச்சர் பதவியேற்றவுடன் பாராட்டுகள் குவிந்தன; தொண்டர்கள் பரிசுப் பொருட்களைக் குவித்தனர்."
  },
  {
    id: 43,
    question: "பொருத்துக: தட்டு, கழி, கழை, அடி",
    options: [
      "சோளம், கரும்பு, மூங்கில், வேம்பு",
      "மூங்கில், சோளம், வேம்பு, கரும்பு",
      "கரும்பு, மூங்கில், வேம்பு, சோளம்",
      "வேம்பு, கரும்பு, சோளம், மூங்கில்"
    ],
    answer: "சோளம், கரும்பு, மூங்கில், வேம்பு"
  },
  {
    id: 44,
    question: "வாழ்நாள் முழுவதும் பின்பற்ற வேண்டியது?",
    options: ["புறநடை", "அகநடை", "வாசிப்பு", "ஒழுக்கம்"],
    answer: "அகநடை"
  },
  {
    id: 45,
    question: "கற்க வேண்டிய அவசியம் வந்தால் நாம் எப்படியாக மாறுகிறோம்?",
    options: ["படிப்பாளிகள்", "அறிஞர்கள்", "ஆரோக்கியம்", "இளமை"],
    answer: "இளமை"
  },

  {
    id: 46,
    question: "'நொறுங்கத் தின்றால் நூறு வயது' - எதனுடன் தொடர்புடையது?",
    options: ["மீதூண் விரும்பேல்", "நோயற்ற வாழ்வு", "நீர்", "உப்பு"],
    answer: "மீதூண் விரும்பேல்"
  },
  {
    id: 47,
    question: "தமிழ்ச் சொல்லைக் கண்டறிக:",
    options: ["சாவி", "பொத்தான்", "சோப்பு", "பிண்டம்"],
    answer: "பிண்டம்"
  },
  {
    id: 48,
    question: "உள்ளத்தேவைகளுக்கானது?",
    options: ["கல்வி", "அறிவுசார் நூல்கள்", "அற நூல்கள்", "கலை"],
    answer: "அற நூல்கள்"
  },
  {
    id: 49,
    question: "இளமையாக இருக்க உதவும் கலை?",
    options: ["அகநடை", "புறநடை", "மருத்துவம்", "கல்வி"],
    answer: "கல்வி"
  },
  {
    id: 50,
    question: "மருத்துவர்கள் வலியுறுத்தும் முக்கிய பயிற்சி?",
    options: ["புறநடைப்பயிற்சி", "அகநடைப்பயிற்சி", "மூச்சுப்பயிற்சி", "வாசிப்பு"],
    answer: "புறநடைப்பயிற்சி"
  }
];


export default function QuizApp() {
  const [name, setName] = useState("");
  const [start, setStart] = useState(false);
  const [index, setIndex] = useState(0);
  const [time, setTime] = useState(15);
  const [selected, setSelected] = useState(null);
  const [showAnswer, setShowAnswer] = useState(false);

  const currentQ = questions[index];

  // ⏳ Timer
  useEffect(() => {
    if (!start) return;

    if (time === 0) {
      nextQuestion();
      return;
    }

    const timer = setTimeout(() => setTime(time - 1), 1000);
    return () => clearTimeout(timer);
  }, [time, start]);

  const handleAnswer = (option) => {
    setSelected(option);
    setShowAnswer(true);

    setTimeout(() => {
      nextQuestion();
    }, 1500);
  };

  const nextQuestion = () => {
    setSelected(null);
    setShowAnswer(false);
    setTime(15);

    if (index < questions.length - 1) {
      setIndex(index + 1);
    } else {
      alert("Quiz Finished 🎉");
      setStart(false);
      setIndex(0);
    }
  };

  // 🎬 Start Screen
  if (!start) {
    return (
      <div style={{ textAlign: "center", marginTop: "100px" }}>
        <h2>Enter Your Name</h2>
        <input
          value={name}
          onChange={(e) => setName(e.target.value)}
          placeholder="Your Name"
        />
        <br /><br />
        <button onClick={() => setStart(true)}>Start Quiz</button>
      </div>
    );
  }

  return (
    <div style={{ textAlign: "center", marginTop: "50px" }}>
      <h2>Welcome {name}</h2>
      <h3>Time Left: {time}s</h3>

      <h2>{currentQ.id}. {currentQ.question}</h2>

      {currentQ.options.map((opt, i) => {
        let bg = "";

        if (showAnswer) {
          if (opt === currentQ.answer) bg = "green";
          else if (opt === selected) bg = "red";
        }

        return (
          <div key={i}>
            <button
              onClick={() => handleAnswer(opt)}
              disabled={showAnswer}
              style={{
                margin: "10px",
                padding: "10px 20px",
                backgroundColor: bg,
                color: "black",
                fontWeight:"800",
                border: "1px solid gray",
                cursor: "pointer",
              }}
            >
              {opt}
            </button>
          </div>
        );
      })}
    </div>
  );
}